[PAD]
[BOS]
[EOS]
[MASK]
[UNK]
[SEP]

B
B1C2CCCC1CCC2
Br
BrB(Br)Br
BrBr
Br[Cu]Br
Br[P+](N1CCCC1)(N1CCCC1)N1CCCC1.F[P-](F)(F)(F)(F)F
C
C(=NC1CCCCC1)=NC1CCCCC1
C1=CCCCC1
C1CCC(P(C2CCCCC2)C2CCCCC2)CC1
C1CCC2=NCCCN2CC1
C1CCCCC1
C1CCNC1
C1CCNCC1
C1CCOC1
C1CC[NH2+]CC1.CC(=O)[O-]
C1CN2CCN1CC2
C1COCCN1
C1COCCO1
C1COCCOCCOCCOCCO1
C1COCCOCCOCCOCCOCCO1
CC#N
CC(=O)CC(C)C
CC(=O)Cl
CC(=O)N(C)C
CC(=O)O
CC(=O)OC(C)=O
CC(=O)OC(C)C
CC(=O)OI1(OC(C)=O)(OC(C)=O)OC(=O)c2ccccc21
CC(=O)O[BH-](OC(C)=O)OC(C)=O.[Na+]
CC(=O)O[Pd]OC(C)=O
CC(=O)[O-].[K+]
CC(=O)[O-].[Na+]
CC(C)(C#N)N=NC(C)(C)C#N
CC(C)(C)O
CC(C)(C)OC(=O)N=NC(=O)OC(C)(C)C
CC(C)(C)ON=O
CC(C)(C)O[K]
CC(C)(C)O[Na]
CC(C)(C)[O-].[K+]
CC(C)(C)[P]([Pd][P](C(C)(C)C)(C(C)(C)C)C(C)(C)C)(C(C)(C)C)C(C)(C)C
CC(C)=O
CC(C)CCO
CC(C)CCON=O
CC(C)CO
CC(C)COC(=O)Cl
CC(C)C[Al+]CC(C)C.[H-]
CC(C)C[AlH]CC(C)C
CC(C)N=C=NC(C)C
CC(C)NC(C)C
CC(C)O
CC(C)OC(=O)/N=N/C(=O)OC(C)C
CC(C)OC(=O)N=NC(=O)OC(C)C
CC(C)OC(C)C
CC(C)O[Ti](OC(C)C)(OC(C)C)OC(C)C
CC(C)[Mg]Cl
CC(C)[N-]C(C)C.[Li+]
CC(C)c1cc(C(C)C)c(-c2ccccc2P(C2CCCCC2)C2CCCCC2)c(C(C)C)c1
CC(Cl)Cl
CC(Cl)OC(=O)Cl
CC1(C)C2CCC1(CS(=O)(=O)O)C(=O)C2
CC1(C)CCCC(C)(C)N1
CC1(C)c2cccc(P(c3ccccc3)c3ccccc3)c2Oc2c(P(c3ccccc3)c3ccccc3)cccc21
CC1CCCO1
CC=C(C)C
CCC#N
CCC(C)(C)O
CCC(C)=O
CCC(C)O
CCCCC
CCCCCC
CCCCCCC
CCCCCO
CCCCN(CCCC)CCCC
CCCCO
CCCCP(=CC#N)(CCCC)CCCC
CCCCP(CCCC)CCCC
CCCC[N+](CCCC)(CCCC)CCCC.[F-]
CCCC[SnH](CCCC)CCCC
CCCC[Sn](=O)CCCC
CCCO
CCCP1(=O)OP(=O)(CCC)OP(=O)(CCC)O1
CCN(C(C)C)C(C)C
CCN(CC)CC
CCN=C=NCCCN(C)C
CCNCC
CCO
CCOC(=O)/N=N/C(=O)OCC
CCOC(=O)Cl
CCOC(=O)N=NC(=O)OCC
CCOC(C)=O
CCOCC
CCOCCO
CCOP(=O)(C#N)OCC
CC[Mg]Br
CC[N+](CC)(CC)S(=O)(=O)N=C([O-])OC
CC[SiH](CC)CC
CN
CN(C)C(=N)N(C)C
CN(C)C(N(C)C)=[N+]1N=[N+]([O-])c2ncccc21.F[P-](F)(F)(F)(F)F
CN(C)C(On1nnc2ccccc21)=[N+](C)C.F[B-](F)(F)F
CN(C)C(On1nnc2ccccc21)=[N+](C)C.F[P-](F)(F)(F)(F)F
CN(C)C(On1nnc2cccnc21)=[N+](C)C.F[P-](F)(F)(F)(F)F
CN(C)C=O
CN(C)CCN(C)C
CN(C)P(=O)(N(C)C)N(C)C
CN(C)[P+](On1nnc2ccccc21)(N(C)C)N(C)C.F[P-](F)(F)(F)(F)F
CN(C)c1ccccc1
CN(C)c1ccccn1
CN(C)c1ccncc1
CN1CCCC1=O
CN1CCCN(C)C1=O
CN1CCOCC1
CN1CC[NH+](C)C1Cl.[Cl-]
CNCCNC
CN[C@@H]1CCCC[C@H]1NC
CO
COC(C)(C)C
COCCO
COCCOC
COCCOCCOC
CO[Na]
COc1cccc(OC)c1-c1ccccc1P(C1CCCCC1)C1CCCCC1
COc1ccccc1
COc1nc(OC)nc([N+]2(C)CCOCC2)n1.[Cl-]
CS(=O)(=O)Cl
CS(=O)(=O)O
CS(C)=O
CSC
C[Al](C)C
C[N+](=O)[O-]
C[N+]1([O-])CCOCC1
C[O-].[Na+]
C[Si](C)(C)Br
C[Si](C)(C)C=[N+]=[N-]
C[Si](C)(C)Cl
C[Si](C)(C)I
C[Si](C)(C)[N-][Si](C)(C)C.[K+]
C[Si](C)(C)[N-][Si](C)(C)C.[Li+]
C[Si](C)(C)[N-][Si](C)(C)C.[Na+]
C[n+]1ccccc1Cl.[I-]
Cc1cc(C)c(N2CCN(c3c(C)cc(C)cc3C)C2=[Ru](Cl)(Cl)(=Cc2ccccc2)[P](C2CCCCC2)(C2CCCCC2)C2CCCCC2)c(C)c1
Cc1cc(C)cc(C)c1
Cc1ccc(C)cc1
Cc1ccc(S(=O)(=O)Cl)cc1
Cc1ccc(S(=O)(=O)O)cc1
Cc1ccc(S(=O)(=O)[O-])cc1.c1cc[nH+]cc1
Cc1cccc(C)n1
Cc1ccccc1
Cc1ccccc1C
Cc1ccccc1P(c1ccccc1C)c1ccccc1C
Cc1ccccc1S(=O)(=O)O
Cc1ccccc1[P](c1ccccc1C)(c1ccccc1C)[Pd](Cl)(Cl)[P](c1ccccc1C)(c1ccccc1C)c1ccccc1C
Cl
ClB(Cl)Cl
ClC(Cl)(Cl)Cl
ClC(Cl)Cl
ClCCCl
ClCCl
ClP(Cl)(Cl)(Cl)Cl
ClP(Cl)Cl
Cl[Cu]
Cl[Cu]Cl
Cl[Fe](Cl)Cl
Cl[Hg]Cl
Cl[Ni]Cl
Cl[Pd](Cl)([P](c1ccccc1)(c1ccccc1)c1ccccc1)[P](c1ccccc1)(c1ccccc1)c1ccccc1
Cl[Pd]Cl
Cl[Sn](Cl)(Cl)Cl
Cl[Sn]Cl
Cl[Ti](Cl)(Cl)Cl
Clc1ccccc1
Clc1ccccc1Cl
FB(F)F
I
II
I[Cu]I
N
N#CC1=C(C#N)C(=O)C(Cl)=C(Cl)C1=O
N#N
NCCN
NN
N[C@@H]1CCCC[C@H]1N
O
O=C(CO)O[CH][C@@H](O)CO
O=C(Cl)C(=O)Cl
O=C(N=NC(=O)N1CCCCC1)N1CCCCC1
O=C(O)C(=O)O
O=C(O)C(F)(F)F
O=C(O)CC(O)(CC(=O)O)C(=O)O
O=C(O)O
O=C(O)[C@@H]1CCCN1
O=C(OC(=O)C(F)(F)F)C(F)(F)F
O=C(OO)c1cccc(Cl)c1
O=C(OOC(=O)c1ccccc1)c1ccccc1
O=C([O-])O
O=C([O-])[O-].[Ca+2]
O=C([O-])[O-].[Cs+].[Cs+]
O=C([O-])[O-].[K+].[K+]
O=C([O-])[O-].[Li+]
O=C([O-])[O-].[Na+].[Na+]
O=C(c1ncc[nH]1)c1ncc[nH]1
O=C(n1ccnc1)n1ccnc1
O=C1CCC(=O)N1Br
O=C1OCCN1P(=O)(Cl)N1CCOC1=O
O=C=O
O=CO
O=C[O-].[NH4+]
O=N[O-].[Na+]
O=O
O=P(Cl)(Cl)Cl
O=P(O)(O)O
O=P([O-])([O-])[O-]
O=P([O-])([O-])[O-].[K+].[K+].[K+]
O=P12OP3(=O)OP(=O)(O1)OP(=O)(O2)O3
O=S(=O)(O)C(F)(F)F
O=S(=O)(O)O
O=S(=O)([O-])C(F)(F)F.O=S(=O)([O-])C(F)(F)F.O=S(=O)([O-])C(F)(F)F.[Yb+3]
O=S(=O)([O-])[O-].[Mg+2]
O=S(=O)([O-])[O-].[Na+].[Na+]
O=S(Cl)Cl
O=S([O-])([O-])=S.[Na+].[Na+]
O=S([O-])S(=O)[O-].[Na+].[Na+]
O=S([O-])[O-].[Na+].[Na+]
O=S1(=O)CCCC1
O=[Ag-]
O=[Ag]
O=[Cr](=O)([O-])Cl.c1cc[nH+]cc1
O=[Cr](=O)([O-])O[Cr](=O)(=O)[O-].c1cc[nH+]cc1.c1cc[nH+]cc1
O=[Cr](=O)=O
O=[Cu-]
O=[Cu]
O=[Mn]=O
O=[N+]([O-])c1ccccc1
O=[Os](=O)(=O)=O
O=[Pt]
O=[Pt]=O
OC(=O)[O-].[K+]
OC(=O)[O-].[Na+]
OCC(F)(F)F
OCC(O)CO
OCCO
OCCOCCO
OO
OS(=O)[O-].[Na+]
On1nnc2ccccc21
On1nnc2cccnc21
S=C=S
[Al+3].[Cl-].[Cl-].[Cl-]
[Al+3].[H-].[H-].[H-].[H-].[Li+]
[Al]
[BH3-]C#N.[Na+]
[BH4-].[Li+]
[BH4-].[Na+]
[Br-].[K+]
[C-]#N.[Na+]
[Ca+2].[Cl-].[Cl-]
[Cl-]
[Cl-].[Li+]
[Cl-].[NH4+]
[Cl-].[Na+]
[Cs+].[F-]
[Cu]
[Cu]Br
[Cu]I
[F-].[K+]
[Fe]
[H-].[Na+]
[H][H]
[I-].[K+]
[I-].[Li+]
[I-].[Na+]
[K+]
[K+].[OH-]
[K]
[Li+].[OH-]
[Li]
[Li]C(C)(C)C
[Li]C(C)CC
[Li]CCCC
[Li]O
[Mg]
[NH4+]
[NH4+].[OH-]
[Na+]
[Na+].[O-]Cl
[Na+].[O-][I+3]([O-])([O-])[O-]
[Na+].[OH-]
[Na]
[Ni]
[O-][Cl+3]([O-])([O-])O
[OH-]
[Pd]
[Pt]
[Rh]
[Ru]
[Zn]
c1c[nH]cn1
c1ccc(Oc2ccccc2)cc1
c1ccc(P(c2ccccc2)c2ccc3ccccc3c2-c2c(P(c3ccccc3)c3ccccc3)ccc3ccccc23)cc1
c1ccc(P(c2ccccc2)c2ccccc2)cc1
c1ccc([PH](c2ccccc2)(c2ccccc2)[Pd-4]([PH](c2ccccc2)(c2ccccc2)c2ccccc2)([PH](c2ccccc2)(c2ccccc2)c2ccccc2)[PH](c2ccccc2)(c2ccccc2)c2ccccc2)cc1
c1ccc([P](c2ccccc2)(c2ccccc2)[Pd]([P](c2ccccc2)(c2ccccc2)c2ccccc2)([P](c2ccccc2)(c2ccccc2)c2ccccc2)[P](c2ccccc2)(c2ccccc2)c2ccccc2)cc1
c1ccc2ncccc2c1
c1ccccc1
c1ccncc1
c1cnc2c(c1)ccc1cccnc12